#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

google_project_service.artifactregistry: Refreshing state... [id=liatrioexercise/artifactregistry.googleapis.com]
google_iam_workload_identity_pool.githubpool: Refreshing state... [id=projects/liatrioexercise/locations/global/workloadIdentityPools/ghauth-pool]
google_project_service.compute: Refreshing state... [id=liatrioexercise/compute.googleapis.com]
google_artifact_registry_repository.artifactrepo: Refreshing state... [id=projects/liatrioexercise/locations/us-west2/repositories/liatrioexercise-repo]
google_project_service.container: Refreshing state... [id=liatrioexercise/container.googleapis.com]
google_service_account.sa: Refreshing state... [id=projects/liatrioexercise/serviceAccounts/githubactionssvc@liatrioexercise.iam.gserviceaccount.com]
google_compute_network.vpc: Refreshing state... [id=projects/liatrioexercise/global/networks/liatrioexercise-vpc]
google_project_iam_binding.sabind: Refreshing state... [id=liatrioexercise/roles/editor]
google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/liatrioexercise/serviceAccounts/githubactionssvc@liatrioexercise.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/830061839325/locations/global/workloadIdentityPools/ghauth-pool/attribute.repository/bboles/liatrioexercise]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/830061839325/locations/global/workloadIdentityPools/ghauth-pool/providers/ghauth-provider]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/liatrioexercise/regions/us-west2/subnetworks/liatrioexercise-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/liatrioexercise/locations/us-west2/clusters/liatrioexercise-gke]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket.my_bucket will be created
  + resource "google_storage_bucket" "my_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "bucket-bboles-02"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @bboles, Action: `pull_request`*